# **Learning Pandas**

In [1]:
import pandas as pd
import numpy as np

There are two types of data structure in pandas
1. Series
2. Data Frame

We'll start analyzimg "The Group of Seven"

In [16]:

#in millions
g7_pop = pd.Series([35.467, 63.9, 80.090, 60.665, 127.061, 64.511, 318.523]) # Changed [] to () for creating a Series

In [17]:
g7_pop

0     35.467
1     63.900
2     80.090
3     60.665
4    127.061
5     64.511
6    318.523
dtype: float64

In [18]:
g7_pop.name = "G7 population in millions"
g7_pop

0     35.467
1     63.900
2     80.090
3     60.665
4    127.061
5     64.511
6    318.523
Name: G7 population in millions, dtype: float64

In [11]:
g7_pop.dtype

dtype('float64')

In [12]:
g7_pop[0]

35.467

In [20]:
g7_pop.index

RangeIndex(start=0, stop=7, step=1)

In [22]:
g7_pop.index = [
    "Canada",
    "France",
    "Germany",
    "Italy",
    "Japan",
    "United Kingdom",
    "United States of America"
]

g7_pop

Canada                       35.467
France                       63.900
Germany                      80.090
Italy                        60.665
Japan                       127.061
United Kingdom               64.511
United States of America    318.523
Name: G7 population in millions, dtype: float64